# да се създаде nympy матрица с размер 8 на 8 и да се запълни шахматно с 0 и 1 без да се ползват цикли.
# да се предложат 3 решения, като не се ползват цикли, а само функции на numpy.

import numpy as np

#============1============
a = np.array([[1, 0], [0, 1]])
mat = np.tile(a, (4, 4))
# print(mat)
#============2============
mat = np.zeros(64).reshape(8, 8)

mat[::2, ::2] = 1
mat[1::2, 1::2] = 1
# print(mat)
#============3============
mat = np.fromfunction(lambda x, y: (x + y) % 2, (8, 8))
print(mat)