from matrix_calass import Matrix

m = Matrix(5, 5)
for i in range(m.rows):
    m[i, i] = i + 1

m1 = m[1]        # връща ред с индекс 1 като списък
m1 = m[:3] 
print(m1)

m2 = m[:, 3]     # връща колона с индекс 3 като списък
print(m2)

m3 = m[1:3, 2:4] # връща под-матрица с указаните индекси
print(m3)

m4 = m[..., 2:4] # връща под-матрица която съдържа всички редове, а колоните са в указания диапазон
print(m4)

m5 = m[2:4, :]   # връща под-матрица която съдържа редове в указания диапазон и всички колони
print(m5)

