"""
да е имплементират следните методи
Matrix(data)
data е параметър на конструктора, който съдържа данни за инциализиране на матрицата от тип list от list-ове.

Забележка: параметрите data, fill и default_value са взаимно изключващи се и не трябва да се подават едновременно.
да не е възможно също едновременно подаване на размерност на матрицата и на data

m = Matrix(data=[[1, 2, 3], [4, 5, 6]])
print(m)

__str__() - връща стринг със съдържанието на матрицата във формат списък от списъци
[[1, 2, 3],
 [4, 5, 6]]

shape - връща tuple с размерността на матрицата

m = Matrix(data=[[1, 2, 3], [4, 5, 6]])
print(m.shape)
# (2, 3)
"""
from data import Matrix

m = Matrix(data=[[1, 2, 3], [4, 5, 6]])
print(m)
print(m.shape)

m = Matrix(rows=2, cols=3, fill=lambda x, y: x + y)
print(m)
print(m.shape)